Autodesk.Revit.DB.MeshEdgeVisibilityOption
Since:
2022
Specifies how to control the visibility of mesh edges.
Since:
2022

Autodesk.Revit.DB.MeshEdgeVisibilityOption.HideAll
Specifies to hide all edges.

Autodesk.Revit.DB.MeshEdgeVisibilityOption.ShowAll
Specifies to show all edges.

Autodesk.Revit.DB.MeshEdgeVisibilityOption.Default
Uses the default algorithm to attempt to hide interior edges.